Tekla.Structures.ModelInternal.dotSurfaceObject_t
Struct for the surface based model object.

Tekla.Structures.ModelInternal.dotSurfaceObject_t.ModelObject
The object we are extending from

Tekla.Structures.ModelInternal.dotSurfaceObject_t.Polymesh
The polymesh that defines the geometry.

Tekla.Structures.ModelInternal.dotSurfaceObject_t.Class
The class attribute.

Tekla.Structures.ModelInternal.dotSurfaceObject_t.Name
The name attribute.

Tekla.Structures.ModelInternal.dotSurfaceObject_t.Type
The type attribute.

Tekla.Structures.ModelInternal.dotSurfaceObject_t.RelatedObjectId
The related object ID.

Tekla.Structures.ModelInternal.dotSurfaceObject_t.CreateHoles
The createholes attribute.